01.developer/04.theory/uml/21.plantuml/sequence_diagram.puml
@startuml
autonumber
actor Client
participant Server
database Database

== Login ==

Client->>Server: Login (Username, Password)
Server->>Database: Select User Info
note over Database: Password is not stored in database
Database-->>Server: Salt & Hash
Server-->>Client: 200 OK & JWT
note over Client, Server: Subsequent requests include JWT
@enduml
